

ScrollReveal().reveal('.animated-element1', { 
    delay: 150, // задержка перед анимацией
    distance: '70px', // расстояние, на которое элемент перемещается в процессе анимации
    duration: 700, // длительность анимации (в миллисекундах)
    easing: 'ease-in-out', // функция плавности анимации
    origin: 'bottom' // направление, из которого появляется элемент
  });
  ScrollReveal().reveal('.animated-element2', { 
    delay: 150, // задержка перед анимацией
    distance: '70px', // расстояние, на которое элемент перемещается в процессе анимации
    duration: 700, // длительность анимации (в миллисекундах)
    easing: 'ease-in-out', // функция плавности анимации
    origin: 'top' // направление, из которого появляется элемент
  });
  ScrollReveal().reveal('.animated-element3', { 
    delay: 150, // задержка перед анимацией
    distance: '70px', // расстояние, на которое элемент перемещается в процессе анимации
    duration: 700, // длительность анимации (в миллисекундах)
    easing: 'ease-in-out', // функция плавности анимации
    origin: 'left' // направление, из которого появляется элемент
  });
  ScrollReveal().reveal('.animated-element4', { 
    delay: 150, // задержка перед анимацией
    distance: '70px', // расстояние, на которое элемент перемещается в процессе анимации
    duration: 700, // длительность анимации (в миллисекундах)
    easing: 'ease-in-out', // функция плавности анимации
    origin: 'right' // направление, из которого появляется элемент
  });